Section_4_Real_Workload_Validation/Experiment13/data/raw/case-A/sustained-ramp/trial_020/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 78.327ms, rate sampling interval: 508ms
  Thread calibration: mean lat.: 66.905ms, rate sampling interval: 476ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   185.16ms  646.15ms   4.16s    94.76%
    Req/Sec   299.88     75.66     1.08k    91.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   23.22ms
 75.000%   41.47ms
 90.000%  119.36ms
 99.000%    3.62s 
 99.900%    3.97s 
 99.990%    4.08s 
 99.999%    4.15s 
100.000%    4.16s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.871     0.000000            1         1.00
      14.223     0.100000        10202         1.11
      15.951     0.200000        20390         1.25
      17.583     0.300000        30642         1.43
      19.647     0.400000        40819         1.67
      23.215     0.500000        50976         2.00
      25.695     0.550000        56085         2.22
      28.527     0.600000        61176         2.50
      31.871     0.650000        66266         2.86
      35.999     0.700000        71360         3.33
      41.471     0.750000        76470         4.00
      44.895     0.775000        79010         4.44
      49.311     0.800000        81564         5.00
      55.071     0.825000        84102         5.71
      64.191     0.850000        86651         6.67
      81.663     0.875000        89199         8.00
      96.575     0.887500        90470         8.89
     119.423     0.900000        91745        10.00
     159.231     0.912500        93023        11.43
     247.039     0.925000        94292        13.33
     450.815     0.937500        95566        16.00
     589.311     0.943750        96205        17.78
    1029.119     0.950000        96841        20.00
    1650.687     0.956250        97481        22.86
    2334.719     0.962500        98116        26.67
    2809.855     0.968750        98752        32.00
    2926.591     0.971875        99073        35.56
    3004.415     0.975000        99395        40.00
    3096.575     0.978125        99714        45.71
    3301.375     0.981250       100028        53.33
    3463.167     0.984375       100354        64.00
    3514.367     0.985938       100505        71.11
    3555.327     0.987500       100664        80.00
    3594.239     0.989062       100834        91.43
    3633.151     0.990625       100988       106.67
    3680.255     0.992188       101141       128.00
    3708.927     0.992969       101231       142.22
    3727.359     0.993750       101300       160.00
    3758.079     0.994531       101383       182.86
    3784.703     0.995313       101462       213.33
    3817.471     0.996094       101544       256.00
    3829.759     0.996484       101582       284.44
    3846.143     0.996875       101621       320.00
    3862.527     0.997266       101662       365.71
    3885.055     0.997656       101701       426.67
    3909.631     0.998047       101741       512.00
    3915.775     0.998242       101765       568.89
    3921.919     0.998437       101778       640.00
    3944.447     0.998633       101801       731.43
    3956.735     0.998828       101819       853.33
    3973.119     0.999023       101839      1024.00
    3983.359     0.999121       101848      1137.78
    3995.647     0.999219       101861      1280.00
    3999.743     0.999316       101873      1462.86
    4003.839     0.999414       101878      1706.67
    4022.271     0.999512       101890      2048.00
    4024.319     0.999561       101893      2275.56
    4034.559     0.999609       101898      2560.00
    4044.799     0.999658       101905      2925.71
    4046.847     0.999707       101908      3413.33
    4059.135     0.999756       101913      4096.00
    4061.183     0.999780       101915      4551.11
    4069.375     0.999805       101918      5120.00
    4071.423     0.999829       101920      5851.43
    4081.663     0.999854       101925      6826.67
    4081.663     0.999878       101925      8192.00
    4083.711     0.999890       101929      9102.22
    4083.711     0.999902       101929     10240.00
    4083.711     0.999915       101929     11702.86
    4091.903     0.999927       101930     13653.33
    4095.999     0.999939       101931     16384.00
    4098.047     0.999945       101932     18204.44
    4100.095     0.999951       101934     20480.00
    4100.095     0.999957       101934     23405.71
    4100.095     0.999963       101934     27306.67
    4100.095     0.999969       101934     32768.00
    4104.191     0.999973       101935     36408.89
    4104.191     0.999976       101935     40960.00
    4104.191     0.999979       101935     46811.43
    4153.343     0.999982       101936     54613.33
    4153.343     0.999985       101936     65536.00
    4153.343     0.999986       101936     72817.78
    4153.343     0.999988       101936     81920.00
    4153.343     0.999989       101936     93622.86
    4157.439     0.999991       101937    109226.67
    4157.439     1.000000       101937          inf
#[Mean    =      185.156, StdDeviation   =      646.147]
#[Max     =     4155.392, Total count    =       101937]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  107690 requests in 3.00m, 87.60MB read
Requests/sec:    598.23
Transfer/sec:    498.33KB